Revit 2026 API

# IExportContextOnElementBegin Method

---

This method marks the beginning of an element to be exported.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
RenderNodeAction OnElementBegin(
	ElementId elementId
)
```
```vb
Function OnElementBegin (
	elementId As ElementId
) As RenderNodeAction
```
```cpp
RenderNodeAction OnElementBegin(
	ElementId^ elementId
)
```
```fsharp
abstract OnElementBegin :
        elementId : ElementId -> RenderNodeAction
```

#### Parameters

elementId ElementId
     The Id of the element that is about to be processed.

#### Return Value

RenderNodeAction Return RenderNodeAction.Skip if you wish to skip exporting this element, or return RenderNodeAction.Proceed otherwise.

This method is never called for 2D export (see cref="Autodesk::Revit::DB::IExportContext2D").

#### Reference

IExportContext Interface

Autodesk.Revit.DB Namespace